# BuiltInFailures.SelectionFailures Class

---
Failures about Selections.
SystemObject Autodesk.Revit.DBBuiltInFailuresSelectionFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class SelectionFailures

    Public NotInheritable Class SelectionFailures

    public ref class SelectionFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type SelectionFailures = class end
The BuiltInFailuresSelectionFailures type exposes the following members.
| Name| Description
---|---|---
| NoElementSelected|  No element selected.
| NoValidElementSelected|  No valid element selected.
Top
#### Reference
Autodesk.Revit.DB Namespace